posts/2015-03-16-prayer-for-lent-4.org
#+date: <2015-03-16>
#+filetags: prayer religion
#+title: Prayer for Lent 4

The best sermons open our eyes to present realities, give us hope for a future in the Kingdom, and challenge us to move forward into that future. Yesterday’s sermon by Mitch Randall​ at NorthHaven Church​ was certainly one of those. Here is the prayer for the week:

God of Justice,

In 1961,\\
the Freedom Riders\\
were beaten with pipes\\
after their bus was bombed\\
in a terrorist act.

I, Lord, would never\\
have swung a pipe in anger.

Fifty-four years later,\\
those on another bus\\
shout ugly chants to\\
reinforce a false\\
sense of superiority.

I, Lord, would have refused\\
to utter the reprehensible words.

Instead, Lord,\\
I am the one\\
who stands in silence,\\
and does nothing,\\
but enables everything.

Lord have mercy\\
on my\\
apathetic,\\
indifferent,\\
lukewarm\\
soul.

/Amen/


#+begin_tagline
Tagged: prayer religion
#+end_tagline
