docs/posts/2015-03-16-prayer-for-lent-4.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 18, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for Lent 4</title>
<meta name="author" content="Randall Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for Lent 4</h1>
<p class="subtitle" role="doc-subtitle">Mar 16, 2015</p>
</header><p>
The best sermons open our eyes to present realities, give us hope for a future in the Kingdom, and challenge us to move forward into that future. Yesterday’s sermon by Mitch Randall​ at NorthHaven Church​ was certainly one of those. Here is the prayer for the week:
</p>

<p>
God of Justice,
</p>

<p>
In 1961,<br>
the Freedom Riders<br>
were beaten with pipes<br>
after their bus was bombed<br>
in a terrorist act.
</p>

<p>
I, Lord, would never<br>
have swung a pipe in anger.
</p>

<p>
Fifty-four years later,<br>
those on another bus<br>
shout ugly chants to<br>
reinforce a false<br>
sense of superiority.
</p>

<p>
I, Lord, would have refused<br>
to utter the reprehensible words.
</p>

<p>
Instead, Lord,<br>
I am the one<br>
who stands in silence,<br>
and does nothing,<br>
but enables everything.
</p>

<p>
Lord have mercy<br>
on my<br>
apathetic,<br>
indifferent,<br>
lukewarm<br>
soul.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 18, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15).
</div>
</footer>
</body>
</html>
